miniproject2/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          3600;
        startFace       1598400;
    }
    outlet
    {
        type            patch;
        nFaces          3600;
        startFace       1602000;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          35900;
        startFace       1605600;
    }
    bodyBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1641500;
    }
)

// ************************************************************************* //
