miniproject2/baseCase/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 293;
        inletValue      uniform 293;
    }

    walls
    {
        type            zeroGradient;
    }
    
    "fluid_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed; 
        value           uniform 293;
        Tnbr            T;
        kappaMethod     fluidThermo;        //get conductivity from fluid thermodynamics model
    }
}


// ************************************************************************* //
