miniproject2/baseCase/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    bodyBottom
    {
        type            fixedValue;
        value           uniform 353;
    }

    "solid_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed; 
        value           uniform 293;
        Tnbr            T;
        kappaMethod     solidThermo;        //get conductivity from solid thermodynamics model
    }
}


// ************************************************************************* //
