miniproject2/baseCase/0/solid/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/solid";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bodyBottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.23e+07
1.23e+07
1.23e+07
1.23e+07
1.23e+07
1.23e+07
1.23e+07
1.23e+07
...
)
;
    }
    solid_to_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
